<html>
<title>php算术运算符</title>
<head>php算术运算符</head>
<body>
<p>
1.算术运算符：<br/>
1.1.++和--分为前++和++，--也分为前--和后--,只对变量操作的<br/>
(前++或--表示是先赋值再加减。后++或--表示先加减再赋值。)<br/>
<br/>
2.赋值运算符<br/>
2.1.当是赋值语句时，右边是具体值，左边是变量。<br/>
2.2.左加,减,乘,除,取模(+=,-=,*=,/=,%=),[$a%=$b等价于%a=$a%$b;]<br/>
<br/>
3.比较运算符:<br/>
3.1.==表示值相等，===表示值和类型全相等。<br/>
3.2.!=表示值不相等，!==表示值或类型不相等。<br/>
3.3.>,<,(>=表示值大于或等于，<=表示值小于或等于。)<br/>
<br/>
4.逻辑运算符：<br/>
4.1.（$a and $b）逻辑与（And优先级比&&和=更低）($a与$b都为真,则为真)<br/>
4.2.（$a or $b）逻辑或（Or优先级比||和=更低）($a与$b任一为真，则为真)<br/>
4.3.（$a xor $b）逻辑异或（Xor）($a与$b任一为true,但不同时是。则为真)<br/>
4.4.（! $a）逻辑非（Not）(如果$a不为真，则为真)<br/>
4.5.（$a && $b）逻辑与（And）($a与$b都为真,则为真)<br/>
4.6.（$a || $b）逻辑或（Or）($a与$b任一为真，则为真)<br/>
4.7.优先级(and< = < &&,or< = < ||)<br/>
<br/>
5.三元运算符：<br/>
基本语法：｛表达式1?表达式2:表达3｝<br/>
规则：如果表达1的运算结果是true,则取表达式2的值<br/>
如果表达1的运算结果为false,则取表达式3的值。<br/>
<br/>
6.字符串运算符<br/>
当两个变量中间使用点（.），表示两个变量(基本数据类型)具体内容拼接<br/>
<br/>
7.类型运算符<br/>
instanceof用于确定一个php变量是否属于某一类class类实例<br/>
通常在面向对象开发中可能用到<br/>

</p>
<br/>
<font size="5" color=green>以下为案列输出结果：</font>
<br/>
<?php
//算术运算符：*************************************************
$a=7/3;
echo 'a='.$a;
//2.3333333333333保留14位，浮点(双精度)最多是14位
//如何将小位数保留到两位

echo '<br/>';

//判断两个数是否能够整除*****************************
$a=90;
$b=5;
if($a%$b==0){
	
	echo '能整除';
}else{
	echo '不能整除';
}

echo '<br/>';

//++ 和--*********************************************
$a=90;
$a++; //等价于$a=$a+1
echo $a;
echo '<br/>';

$b=89;//等价于$b=$b-1
$b--;
echo $b;
echo '<br/>';

$a=56;
$b=$a++;//等价于$b=$a;$a=$a+1
echo $b.'||'.$a;
echo '<br/>';

$a=56;
$b=++$a;//等价于$a=$a+1;$b=$a;
echo $b.'||'.$a;
echo '<br/>';

//赋值运算符----左加,减,乘,除,取模(+=,-=,*=,/=,%=)************
$a=90;
$a+=90;//等价于$a=$a+90;
echo $a;
echo '<br/>';

//比较运算符
$a=2;
$b=2.0;
if($a===$b){//==表示值相等则为真，===表示值和类型全相等则为true
	echo '$a=$b';
}else{
	echo '$a不等于$b';
echo '<br/>';

}
if($a!=$b){//只有值不相等，则为true;
	echo '$a!=$b';
}
echo '<br/>';
if($a!==$b){//只要值或类型不相等，则为true.
	echo '$a!==$b';
}
echo '<br/>';
//***********逻辑运算符***********：
$a=8;
$b=7;
if($a++>8 || $b++>7){//先判断后++
	echo 'ok!';
}
echo ' a='.$a.' b='.$b;
//********逻辑运算符优先级***********
$e=false||true;//$e为true
$f=false or true;//$f为false,因为or的优先级比等号（=）低。
var_dump($e,$f);
echo "<br/>";

//三元运算符：表达1的运算结果是true,则取表达式2的值，为false取表达式3的值。
$a=90;
$b=180;
$c=$a>$b? (12-10):"hello.world";
echo 'c='.$c;
echo '<br/>';

//字符串运算符
$a="hello.world";
$b=123;
$c=$a.$b;//$a具体表示内容和$b表示内容拼接。
echo 'c='.$c;
echo '<br/>';

//类运算符：
class Dog{}
class Cat{}
$cat1=new Cat;
//var_dump($cat instanceof Dog);
//判断某个变量是否属于某个类，只能判断变量。
if($cat1 instanceof Cat){
	echo '$cat1是一只猫';
}
echo '<br/>';

//运算优先级:
$a=3;
$b=++$a*3;
echo $b;//12

$a=3;
$b=$a++*3;
echo $b;//9
?>
</body>
</html>










